

function check(){
	var idArr = ['yymc','dz','clsj','fwdh','yyjj','tsly'];
	for(var i  in idArr){
		var flag = 0;
		var ele = document.getElementById(idArr[i]);
		if(ele.value == ""){
			flag = 1;
			ele.style.border = "#fc0 1px solid";
		}else{
			ele.style.border = "#3a5168 1px solid";
		}
	}

	if(flag == 1){
		alert("请完善必要信息");
	}else{
		document.getElementById("frm").submit();
	}
}


var djArr = ['一级甲等','一级乙等','二级甲等','二级乙等','三级甲等','三级乙等','其他'];

function writeDjCode(){
	var code = '';
	for(var i in djArr){
		code += '<option value="'+djArr[i]+'">'+djArr[i]+'</option>';
	}
	document.write(code);
	selectcity(0,0);
	//return code;
}



var province =  [
'新疆维吾尔自治区',
'宁夏回族自治区',
'青海省',
'甘肃省',
'陕西省',
'西藏自治区',
'云南省',
'贵州省',
'四川省',
'重庆市',
'海南省',
'广西壮族自治区',
'广东省',
'湖南省',
'湖北省',
'河南省',
'山东省',
'江西省',
'福建省',
'安徽省',
'浙江省',
'江苏省',
'上海市',
'黑龙江省',
'吉林省',
'辽宁省',
'内蒙古自治区',
'山西省',
'河北省',
'天津市',
'北京市'];
//alert(province)
function writeProvinceCode(){
	var code = '';
	for(var i in province){

		code += '<option value="'+i+'">'+province[i]+'</option>';
	}
	document.write(code);
}


function selectS(index){
	var code = '';
	for(var i in province){
		if(index==i){
			code += '<option value="'+i+'" selected="true">'+province[i]+'</option>';
		}else{
			code += '<option value="'+i+'">'+province[i]+'</option>';
		}
	}

	document.getElementById("s1").innerHTML=code;


}

function selectcityOnly(e){
	oncityQh = cityQhArr[e];
	//alert(oncityQh)
	var ddd = oncityQh.join(",");
	//alert("ddd:"+ddd)
	window.location.href = "?citybhs="+ddd+"&index="+e;

}

var   shengIndex = 0;
function selectcity(e,e2){

	shengIndex = e;
	var oncity = cityArr[e];
	var code = '';
	document.getElementById('s2').style.visibility= oncity.length?'visible':'hidden';
	for(var i in oncity){
//		code += '<option value="'+i+'">'+oncity[i]+'</option>';
		
		if(e2==i){
			code += '<option value="'+i+'" selected="true">'+oncity[i]+'</option>';
		}else{
			code += '<option value="'+i+'">'+oncity[i]+'</option>';
		}
		
	}
	document.getElementById("s2").innerHTML=code;
	selectcity2(e2)
}
function selectcity2(e){

	try{

		var qh = cityQhArr[shengIndex][e]
		document.getElementById("dqbhcode").value = qh;

		//alert(qh)
	}catch (e){
		alert(e)
	}
}

var cityArr = [
['省直辖行政单位','阿勒泰地区','塔城地区','伊犁哈萨克自治州','和田地区','喀什地区','克孜勒苏柯尔克孜自治州','阿克苏地区','巴音郭楞蒙古自治州','博尔塔拉蒙古自治州','昌吉回族自治州','哈密地区','吐鲁番地区','克拉玛依市','乌鲁木齐市'],
['中卫市','固原市','吴忠市','石嘴山市','银川市'],
['海西蒙古族藏族自治州','玉树藏族自治州','果洛藏族自治州','海南藏族自治州','黄南藏族自治州','海北藏族自治州','海东地区','西宁市'],
['甘南藏族自治州','临夏回族自治州','陇南市','定西市','庆阳市','酒泉市','平凉市','张掖市','武威市','天水市','白银市','金昌市','嘉峪关市','兰州市'],
['商洛市','安康市','榆林市','汉中市','延安市','渭南市','咸阳市','宝鸡市','铜川市','西安市'],
['林芝地区','阿里地区','那曲地区','日喀则地区','山南地区','昌都地区','拉萨市'],
['迪庆藏族自治州','怒江傈僳族自治州','德宏傣族景颇族自治州','大理白族自治州','西双版纳傣族自治州','文山壮族苗族自治州','红河哈尼族彝族自治州','楚雄彝族自治州','临沧市','思茅市','丽江市','昭通市','保山市','玉溪市','曲靖市','昆明市'],
['黔南布依族苗族自治州','黔东南苗族侗族自治州','毕节地区','黔西南布依族苗族自治州','铜仁地区','安顺市','遵义市','六盘水市','贵阳市'],
['凉山彝族自治州','甘孜藏族自治州','阿坝藏族羌族自治州','资阳市','巴中市','雅安市','达州市','广安市','宜宾市','眉山市','南充市','乐山市','内江市','遂宁市','广元市','绵阳市','德阳市','泸州市','攀枝花市','自贡市','成都市'],
['南川市','永川市','合川市','江津市','彭水苗族土家族自治县','酉阳土家族苗族自治县','秀山土家族苗族自治县','石柱土家族自治县','巫溪县','巫山县','奉节县','云阳县','开　县','忠　县','武隆县','垫江县','丰都县','城口县','梁平县','璧山县','荣昌县','大足县','铜梁县','潼南县','綦江县','长寿区','黔江区','巴南区','渝北区','双桥区','万盛区','北碚区','南岸区','九龙坡区','沙坪坝区','江北区','大渡口区','渝中区','涪陵区','万州区'],
['省直辖县级行政单位','三亚市','海口市'],
['崇左市','来宾市','河池市','贺州市','百色市','玉林市','贵港市','钦州市','防城港市','北海市','梧州市','桂林市','柳州市','南宁市'],
['云浮市','揭阳市','潮州市','中山市','东莞市','清远市','阳江市','河源市','汕尾市','梅州市','惠州市','肇庆市','茂名市','湛江市','江门市','佛山市','汕头市','珠海市','深圳市','韶关市','广州市'],
['湘西土家族苗族自治州','娄底市','怀化市','永州市','郴州市','益阳市','张家界市','常德市','岳阳市','邵阳市','衡阳市','湘潭市','株洲市','长沙市'],
['省直辖行政单位','恩施土家族苗族自治州','随州市','咸宁市','黄冈市','荆州市','孝感市','荆门市','鄂州市','襄樊市','宜昌市','十堰市','黄石市','武汉市'],
['驻马店市','周口市','信阳市','商丘市','南阳市','三门峡市','漯河市','许昌市','濮阳市','焦作市','新乡市','鹤壁市','安阳市','平顶山市','洛阳市','开封市','郑州市'],
['荷泽市','滨州市','聊城市','德州市','临沂市','莱芜市','日照市','威海市','泰安市','济宁市','潍坊市','烟台市','枣庄市','淄博市','青岛市','济南市'],
['上饶市','抚州市','宜春市','吉安市','赣州市','鹰潭市','新余市','九江市','萍乡市','景德镇市','南昌市'],
['宁德市','龙岩市','南平市','漳州市','泉州市','三明市','莆田市','厦门市','福州市'],
['宣城市','池州市','亳州市','六安市','巢湖市','宿州市','阜阳市','滁州市','黄山市','安庆市','铜陵市','淮北市','马鞍山市','淮南市','蚌埠市','芜湖市','合肥市'],
['丽水市','台州市','舟山市','衢州市','金华市','绍兴市','湖州市','嘉兴市','温州市','宁波市','杭州市'],
['宿迁市','泰州市','镇江市','扬州市','盐城市','淮安市','连云港市','南通市','苏州市','常州市','徐州市','无锡市','南京市'],
['崇明县','奉贤区','南汇区','青浦区','松江区','金山区','浦东新区','嘉定区','宝山区','闵行区','杨浦区','虹口区','闸北区','普陀区','静安区','长宁区','徐汇区','卢湾区','黄浦区'],
['大兴安岭地区','绥化市','黑河市','牡丹江市','七台河市','佳木斯市','伊春市','大庆市','双鸭山市','鹤岗市','鸡西市','齐齐哈尔市','哈尔滨市'],
['延边朝鲜族自治州','白城市','松原市','白山市','通化市','辽源市','四平市','吉林市','长春市'],
['葫芦岛市','朝阳市','铁岭市','盘锦市','辽阳市','阜新市','营口市','锦州市','丹东市','本溪市','抚顺市','鞍山市','大连市','沈阳市'],
['阿拉善盟','锡林郭勒盟','兴安盟','乌兰察布市','巴彦淖尔市','呼伦贝尔市','鄂尔多斯市','通辽市','赤峰市','乌海市','包头市','呼和浩特市'],
['吕梁市','临汾市','忻州市','运城市','晋中市','朔州市','晋城市','长治市','阳泉市','大同市','太原市'],
['沧州市','衡水市','廊坊市','承德市','张家口市','保定市','邢台市','邯郸市','秦皇岛市','唐山市','石家庄市'],
['蓟　县','静海县','宁河县','宝坻区','武清区','北辰区','津南区','西青区','东丽区','大港区','汉沽区','塘沽区','红桥区','河北区','南开区','河西区','河东区','和平区'],
['延庆县','密云县','平谷区','怀柔区','大兴区','昌平区','顺义区','通州区','房山区','门头沟区','海淀区','石景山区','丰台区','朝阳区','宣武区','崇文区','西城区','东城区']
];

var cityQhArr = [
[16015,16014,16013,16012,16011,16010,16009,16008,16007,16006,16005,16004,16003,16002,16001],
[15505,15504,15503,15502,15501],
[15008,15007,15006,15005,15004,15003,15002,15001],
[14514,14513,14512,14511,14510,14509,14508,14507,14506,14505,14504,14503,14502,14501],
[14010,14009,14008,14007,14006,14005,14004,14003,14002,14001],
[13507,13506,13505,13504,13503,13502,13501],
[13016,13015,13014,13013,13012,13011,13010,13009,13008,13007,13006,13005,13004,13003,13002,13001],
[12509,12508,12507,12506,12505,12504,12503,12502,12501],
[12021,12020,12019,12018,12017,12016,12015,12014,12013,12012,12011,12010,12009,12008,12007,12006,12005,12004,12003,12002,12001],
[11540,11539,11538,11537,11536,11535,11534,11533,11532,11531,11530,11529,11528,11527,11526,11525,11524,11523,11522,11521,11520,11519,11518,11517,11516,11515,11514,11513,11512,11511,11510,11509,11508,11507,11506,11505,11504,11503,11502,11501],
[11003,11002,11001],
[10514,10513,10512,10511,10510,10509,10508,10507,10506,10505,10504,10503,10502,10501],
[10021,10020,10019,10018,10017,10016,10015,10014,10013,10012,10011,10010,10009,10008,10007,10006,10005,10004,10003,10002,10001],
[9514,9513,9512,9511,9510,9509,9508,9507,9506,9505,9504,9503,9502,9501],
[9014,9013,9012,9011,9010,9009,9008,9007,9006,9005,9004,9003,9002,9001],
[8517,8516,8515,8514,8513,8512,8511,8510,8509,8508,8507,8506,8505,8504,8503,8502,8501],
[8016,8015,8014,8013,8012,8011,8010,8009,8008,8007,8006,8005,8004,8003,8002,8001],
[7511,7510,7509,7508,7507,7506,7505,7504,7503,7502,7501],
[7009,7008,7007,7006,7005,7004,7003,7002,7001],
[6517,6516,6515,6514,6513,6512,6511,6510,6509,6508,6507,6506,6505,6504,6503,6502,6501],
[6011,6010,6009,6008,6007,6006,6005,6004,6003,6002,6001],
[5513,5512,5511,5510,5509,5508,5507,5506,5505,5504,5503,5502,5501],
[5019,5018,5017,5016,5015,5014,5013,5012,5011,5010,5009,5008,5007,5006,5005,5004,5003,5002,5001],
[4513,4512,4511,4510,4509,4508,4507,4506,4505,4504,4503,4502,4501],
[4009,4008,4007,4006,4005,4004,4003,4002,4001],
[3514,3513,3512,3511,3510,3509,3508,3507,3506,3505,3504,3503,3502,3501],
[3012,3011,3010,3009,3008,3007,3006,3005,3004,3003,3002,3001],
[2511,2510,2509,2508,2507,2506,2505,2504,2503,2502,2501],
[2011,2010,2009,2008,2007,2006,2005,2004,2003,2002,2001],
[1518,1517,1516,1515,1514,1513,1512,1511,1510,1509,1508,1507,1506,1505,1504,1503,1502,1501],
[1018,1017,1016,1015,1014,1013,1012,1011,1010,1009,1008,1007,1006,1005,1004,1003,1002,1001]
];


function xgdq(dqbh){
	var bj1 = 0;
	var bj2 = 0;
	for (var i in cityQhArr) {
		for(var j in cityQhArr[i]){
			var tempDqbh = cityQhArr[i][j];
			if (dqbh == tempDqbh) {
				bj1 = i;
				bj2 = j;
//				alert(bj1+"    "+bj2);
				break;
			}
		}
	}
	var code = '';
	for(var i in province){
		if(bj1==i){
			code += '<option value="'+i+'" selected="true">'+province[i]+'</option>';
		}else{
			code += '<option value="'+i+'">'+province[i]+'</option>';
		}
	}
	document.getElementById("s1").innerHTML=code;
	selectcity(bj1,bj2);
}

function xgdj(djmc){
	var temp = 0;
	for(var i in djArr){
		if (djmc==djArr[i]) {
			temp = i;
			break;
		}
	}
//	alert(temp+"   "+djmc)
	var code = '';
	for(var i in djArr){
		if(temp==i){
			code += '<option value="'+djArr[i]+'" selected="true">'+djArr[i]+'</option>';
		}else{
			code += '<option value="'+djArr[i]+'">'+djArr[i]+'</option>';
		}
	}
	document.getElementById("yydj").innerHTML=code;
	
}

function setYyid (yyid){
	document.getElementById("yyid").value = yyid;
}












